[["Geometry is, with arithmetic, one of the oldest branches of mathematics. It is concerned with properties of space such as the distance, shape, size, and relative position of figures.", [[0, 8, "Actor"], [18, 28, "Actor"], [60, 71, "Actor"], [126, 134, "Actor"], [136, 141, "Actor"], [143, 147, "Actor"], [153, 170, "Actor"]]], ["Music is generally defined as the art of arranging sound to create some combination of form, harmony, melody, rhythm or otherwise expressive content. Exact definitions of music vary considerably around the world, though it is an aspect of all human societies, a cultural universal. While scholars agree that music is defined by a few specific elements, there is no consensus on their precise definitions. The creation of music is commonly divided into musical composition, musical improvisation, and musical performance, though the topic itself extends into academic disciplines, criticism, philosophy, and psychology. Music may be performed or improvised using a vast range of instruments, including the human voice.", [[0, 5, "Actor"], [87, 91, "Actor"], [93, 100, "Actor"], [102, 108, "Actor"], [110, 116, "Actor"], [243, 258, "Actor"], [288, 296, "Actor"], [452, 471, "Actor"], [473, 494, "Actor"], [500, 519, "Actor"], [558, 578, "Actor"], [591, 601, "Actor"], [607, 617, "Actor"], [669, 689, "Actor"], [705, 716, "Actor"]]], ["Astronomy is a natural science that studies celestial objects and phenomena. It uses mathematics, physics, and chemistry in order to explain their origin and evolution. Objects of interest include planets, moons, stars, nebulae, galaxies, and comets. Relevant phenomena include supernova explosions, gamma ray bursts, quasars, blazars, pulsars, and cosmic microwave background radiation. More generally, astronomy studies everything that originates beyond Earth's atmosphere. Cosmology is a branch of astronomy that studies the universe as a whole.", [[0, 9, "Actor"], [15, 30, "Actor"], [44, 75, "Actor"], [85, 96, "Actor"], [98, 105, "Actor"], [111, 120, "Actor"], [197, 204, "Actor"], [206, 211, "Actor"], [213, 218, "Actor"], [220, 227, "Actor"], [229, 237, "Actor"], [243, 249, "Actor"], [278, 287, "Actor"], [300, 309, "Actor"], [310, 316, "Actor"], [318, 325, "Actor"], [327, 334, "Actor"], [336, 343, "Actor"], [349, 365, "Actor"], [366, 386, "Actor"], [456, 474, "Actor"], [476, 485, "Actor"], [491, 510, "Actor"], [528, 536, "Actor"], [404, 413, "Actor"]]], ["A conspiracy theory is an explanation for an event or situation that asserts the existence of a conspiracy by powerful and sinister groups, often political in motivation, when other explanations are more probable. The term generally has a negative connotation, implying that the appeal of a conspiracy theory is based in prejudice, emotional conviction, or insufficient evidence. A conspiracy theory is distinct from a conspiracy; it refers to a hypothesized conspiracy with specific characteristics, including but not limited to opposition to the mainstream consensus among those who are qualified to evaluate its accuracy, such as scientists or historians.", [[2, 19, "Actor"], [2, 12, "Actor"], [123, 138, "Actor"], [239, 259, "Actor"], [2, 19, "Actor"], [332, 352, "Actor"], [2, 19, "Actor"], [2, 12, "Actor"], [446, 469, "Actor"], [475, 499, "Actor"], [548, 568, "Actor"], [633, 643, "Actor"], [647, 657, "Actor"]]], ["Project MKUltra was an illegal human experimentation program designed and undertaken by the U.S. Central Intelligence Agency , intended to develop procedures and identify drugs that could be used in interrogations to weaken individuals and force confessions through brainwashing and psychological torture. It began in 1953 and was halted in 1973. MKUltra used numerous methods to manipulate its subjects' mental states and brain functions, such as the covert administration of high doses of psychoactive drugs  and other chemicals without the subjects' consent, electroshocks, hypnosis, sensory deprivation, isolation, verbal and sexual abuse, and other forms of torture.", [[0, 15, "Actor"], [31, 60, "Actor"], [92, 95, "Actor"], [97, 124, "Actor"], [171, 176, "Actor"], [224, 235, "Actor"], [283, 304, "Actor"], [266, 278, "Actor"], [8, 15, "Actor"], [405, 418, "Actor"], [423, 438, "Actor"], [491, 509, "Actor"], [521, 530, "Actor"], [562, 575, "Actor"], [577, 585, "Actor"], [587, 606, "Actor"], [608, 617, "Actor"], [619, 642, "Actor"], [297, 304, "Actor"]]], ["An electronic component is any basic discrete device or physical entity in an electronic system used to affect electrons or their associated fields. Electronic components are mostly industrial products, available in a singular form and are not to be confused with electrical elements, which are conceptual abstractions representing idealized electronic components and elements.", [[3, 23, "Actor"], [37, 52, "Actor"], [56, 71, "Actor"], [78, 95, "Actor"], [111, 120, "Actor"], [141, 147, "Actor"], [149, 170, "Actor"], [182, 201, "Actor"], [264, 283, "Actor"], [295, 318, "Actor"], [342, 363, "Actor"], [275, 283, "Actor"]]], ["A diode is a two-terminal electronic component that conducts current primarily in one direction; it has low resistance in one direction, and high resistance in the other.", [[2, 7, "Actor"], [13, 46, "Actor"], [61, 68, "Actor"], [104, 118, "Actor"], [141, 156, "Actor"]]], ["In mathematics, an integral assigns numbers to functions in a way that describes displacement, area, volume, and other concepts that arise by combining infinitesimal data. The process of finding integrals is called integration. Along with differentiation, integration is a fundamental, essential operation of calculus, and serves to solve problems in mathematics and physics involving the area of an arbitrary shape, the length of a curve, and the volume of a solid, among others.", [[3, 14, "Actor"], [19, 27, "Actor"], [47, 56, "Actor"], [81, 93, "Actor"], [95, 99, "Actor"], [101, 107, "Actor"], [119, 127, "Actor"], [152, 170, "Actor"], [176, 183, "Actor"], [195, 204, "Actor"], [215, 226, "Actor"], [339, 347, "Actor"], [3, 14, "Actor"], [367, 374, "Actor"], [95, 99, "Actor"], [400, 415, "Actor"], [433, 438, "Actor"], [101, 107, "Actor"], [460, 465, "Actor"]]], ["In mathematics, the derivative of a function of a real variable measures the sensitivity to change of the function value  with respect to a change in its argument. Derivatives are a fundamental tool of calculus. For example, the derivative of the position of a moving object with respect to time is the object's velocity: this measures how quickly the position of the object changes when time advances.", [[3, 14, "Actor"], [20, 30, "Actor"], [36, 44, "Actor"], [50, 63, "Actor"], [106, 120, "Actor"], [154, 162, "Actor"], [164, 175, "Actor"], [182, 198, "Actor"], [202, 210, "Actor"], [247, 255, "Actor"], [291, 295, "Actor"], [261, 274, "Actor"], [303, 320, "Actor"], [247, 255, "Actor"], [268, 274, "Actor"], [291, 295, "Actor"]]], ["In mathematics, the complex plane is the plane formed by the complex numbers, with a Cartesian coordinate system such that the x-axis, called the real axis, is formed by the real numbers, and the y-axis, called the imaginary axis, is formed by the imaginary numbers.\nThe complex plane allows a geometric interpretation of complex numbers. Under addition, they add like vectors. The multiplication of two complex numbers can be expressed more easily in polar coordinates—the magnitude or modulus of the product is the product of the two absolute values, or moduli, and the angle or argument of the product is the sum of the two angles, or arguments. In particular, multiplication by a complex number of modulus 1 acts as a rotation.", [[3, 14, "Actor"], [20, 33, "Actor"], [61, 76, "Actor"], [85, 112, "Actor"], [127, 133, "Actor"], [146, 155, "Actor"], [174, 186, "Actor"], [196, 202, "Actor"], [215, 229, "Actor"], [248, 265, "Actor"], [20, 33, "Actor"], [294, 318, "Actor"], [61, 76, "Actor"], [369, 376, "Actor"], [452, 469, "Actor"], [502, 509, "Actor"], [536, 551, "Actor"], [572, 577, "Actor"], [627, 633, "Actor"], [638, 647, "Actor"], [61, 75, "Actor"]]], ["In mathematics, orientability is a property of some topological spaces such as real vector spaces, Euclidean spaces, surfaces, and more generally manifolds that allows a consistent definition of \"clockwise\" and \"counterclockwise\". A space is orientable if such a consistent definition exists. In this case, there are two possible definitions, and a choice between them is an orientation of the space. Real vector spaces, Euclidean spaces, and spheres are orientable. A space is non-orientable if \"clockwise\" is changed into \"counterclockwise\" after running through some loops in it, and coming back to the starting point. This means that a geometric shape, such as Small pie.svg, that moves continuously along such a loop is changed into its own mirror image Pie A Möbius strip is an example of a non-orientable space.", [[3, 14, "Actor"], [16, 29, "Actor"], [52, 70, "Actor"], [79, 97, "Actor"], [99, 115, "Actor"], [117, 125, "Actor"], [146, 155, "Actor"], [196, 205, "Actor"], [212, 228, "Actor"], [375, 386, "Actor"], [64, 69, "Actor"], [401, 419, "Actor"], [99, 115, "Actor"], [443, 450, "Actor"], [196, 205, "Actor"], [212, 228, "Actor"], [570, 575, "Actor"], [640, 655, "Actor"], [765, 777, "Actor"]]], ["Audio signal processing is a subfield of signal processing that is concerned with the electronic manipulation of audio signals. Audio signals are electronic representations of sound waves—longitudinal waves which travel through air, consisting of compressions and rarefactions. The energy contained in audio signals is typically measured in decibels. As audio signals may be represented in either digital or analog format, processing may occur in either domain. Analog processors operate directly on the electrical signal, while digital processors operate mathematically on its digital representation.", [[0, 23, "Actor"], [29, 37, "Actor"], [6, 23, "Actor"], [86, 109, "Actor"], [113, 126, "Actor"], [128, 141, "Actor"], [146, 172, "Actor"], [176, 187, "Actor"], [188, 206, "Actor"], [228, 231, "Actor"], [247, 259, "Actor"], [264, 276, "Actor"], [282, 288, "Actor"], [113, 126, "Actor"], [341, 349, "Actor"], [113, 126, "Actor"], [397, 421, "Actor"], [13, 23, "Actor"], [454, 460, "Actor"], [462, 479, "Actor"], [505, 521, "Actor"], [529, 547, "Actor"], [548, 570, "Actor"], [578, 600, "Actor"]]], ["Most vegetables attain their best eating quality when allowed to ripen on the plant, but often this peak quality is reached before the vegetable is fully mature (i.e., cucumbers, squash, okra, sweet corn, peas, and beans). As a result, many gardeners fall into the “bigger is better” mindset and allow crops to stay on the plant too long. For instance, novice okra growers may leave pods on the plant too long, opting for a larger product. However, okra pods quickly become over-mature and woody, rendering them inedible.", [[5, 15, "Actor"], [78, 83, "Actor"], [100, 112, "Actor"], [5, 14, "Actor"], [154, 160, "Actor"], [168, 177, "Actor"], [179, 185, "Actor"], [187, 191, "Actor"], [193, 203, "Actor"], [205, 209, "Actor"], [215, 220, "Actor"], [241, 250, "Actor"], [265, 291, "Actor"], [302, 307, "Actor"], [78, 83, "Actor"], [353, 372, "Actor"], [383, 387, "Actor"], [78, 83, "Actor"], [449, 458, "Actor"], [474, 485, "Actor"], [490, 495, "Actor"]]], ["Almost all vegetables are best when harvested early in the morning. Overnight, vegetables regain moisture that they lost during the day, and starches formed during the day may be converted to sugars during the evening. These traits make morning-harvested produce crisper, juicier, and sweeter. If you cannot harvest in the morning, produce should be kept out of direct sunlight and cooled as soon as possible to slow degradation. Vegetable quality is the highest at the moment of harvest and begins to decrease rapidly afterward.", [[11, 21, "Actor"], [59, 66, "Actor"], [97, 105, "Actor"], [132, 135, "Actor"], [141, 149, "Actor"], [192, 198, "Actor"], [362, 377, "Actor"], [417, 428, "Actor"], [430, 439, "Actor"], [36, 43, "Actor"]]], ["Growing Media: Select a seed starting mix, not garden soil for your growing media. Garden soil is going to have weed seeds and possibly diseases in it. Additionally, garden soil tends to be very dense and heavy, which means it won't drain as well as seed-starting or potting soil will. Seed starting mix is sterile and is usually made from milled peat moss, perlite, coconut coir, and vermiculite. This combination provides a light fine-textured media that is ideal for starting seeds.", [[24, 41, "Actor"], [47, 58, "Actor"], [112, 122, "Actor"], [136, 144, "Actor"], [47, 58, "Actor"], [250, 279, "Actor"], [286, 303, "Actor"], [307, 314, "Actor"], [340, 356, "Actor"], [358, 365, "Actor"], [367, 379, "Actor"], [385, 396, "Actor"], [432, 451, "Actor"], [117, 122, "Actor"]]], ["By mid-to late-March, it's too late to start cool-season vegetables such as broccoli, Brussels sprouts, cabbage, and cauliflower which should be started from seed in late February and early March. But there's plenty of time to start warm-season vegetables such as tomatoes and peppers, which can be started mid-March to early April.", [[57, 67, "Actor"], [76, 84, "Actor"], [86, 102, "Actor"], [104, 111, "Actor"], [117, 128, "Actor"], [158, 162, "Actor"], [264, 272, "Actor"], [57, 67, "Actor"], [277, 284, "Actor"]]], ["Soil is composed of three basic mineral particles, of three different sizes; sand being the largest particle, silt intermediate, and clay the smallest. Sand, silt, and clay each have characteristics that are specific to each particle. For example, sand is a larger particle and does not “pack” as tightly which creates larger pore spaces; because of this, water easily passes through sandy soil. This is good for drainage; however, it is bad for water holding capacity and is why sandy soils tend to dry out more rapidly. Clay particles are the smallest particles which allows them to pack tight and hold water better; however, clay can hold water too well which leads to poorly drained soil. The percentage of each particle in a soil determines the soil’s texture as well as its physical properties. An ideal soil texture consists of equal parts of sand, silt, and clay; this type of soil is referred to as “loam.” Usually, one component predominates, producing a clay loam or a sandy loam.", [[0, 4, "Actor"], [32, 49, "Actor"], [77, 81, "Actor"], [110, 114, "Actor"], [133, 137, "Actor"], [152, 156, "Actor"], [110, 114, "Actor"], [133, 137, "Actor"], [40, 48, "Actor"], [77, 81, "Actor"], [326, 337, "Actor"], [384, 394, "Actor"], [356, 361, "Actor"], [413, 421, "Actor"], [446, 468, "Actor"], [480, 491, "Actor"], [522, 526, "Actor"], [356, 361, "Actor"], [133, 137, "Actor"], [672, 691, "Actor"], [390, 394, "Actor"], [750, 764, "Actor"], [780, 799, "Actor"], [810, 822, "Actor"], [77, 81, "Actor"], [110, 114, "Actor"], [133, 137, "Actor"], [390, 394, "Actor"], [909, 913, "Actor"], [929, 938, "Actor"], [965, 974, "Actor"], [980, 990, "Actor"]]], ["In addition to soil texture, it is important to know and understand the pH and nutrient availability of your soil. Soil pH and nutrient availability can be assessed through a soil sample. Our Horticulture educator Chris Enroth provides us with great information on how to properly collect a soil sample . Soil sampling is not something that needs to be done every year. Ideally, it would be done every 3 years. Soil pH is a measure of acidity or alkalinity with an ideal soil pH of 6.5; the pH ranges from 6.0 to 7.0 is ideal for most garden vegetables. See Figure 2 for pH specifics for different vegetable crops. Soil pH can be raised (more alkaline) with the addition of lime or lowered (more acidic) with the addition of sulfur. Raising and lowering your pH does take time; once lime or sulfur is applied, it can take a year or more to see any movement in pH.", [[15, 27, "Actor"], [72, 74, "Actor"], [79, 100, "Actor"], [15, 19, "Actor"], [115, 122, "Actor"], [79, 100, "Actor"], [175, 186, "Actor"], [79, 100, "Actor"], [192, 213, "Actor"], [214, 226, "Actor"], [175, 186, "Actor"], [305, 318, "Actor"], [115, 122, "Actor"], [424, 456, "Actor"], [471, 478, "Actor"], [491, 500, "Actor"], [72, 74, "Actor"], [535, 552, "Actor"], [598, 613, "Actor"], [115, 122, "Actor"], [643, 651, "Actor"], [696, 702, "Actor"], [674, 678, "Actor"], [725, 731, "Actor"], [72, 74, "Actor"], [674, 678, "Actor"], [725, 731, "Actor"], [72, 74, "Actor"]]], ["As was stated above, the soil is choked full of weed seeds (known as the “weed seed bank”). These seeds may be generations old, or blow in every year on the wind, or deposited by a bird or other animal. As an example, when a neighbor’s brush pile fire got out of control and burned my parent's cow pasture, this created quite a disturbance. Following that fire, we saw native plant species that likely haven’t grown in that pasture for decades.", [[25, 29, "Actor"], [48, 58, "Actor"], [74, 88, "Actor"], [53, 58, "Actor"], [181, 185, "Actor"], [195, 201, "Actor"], [225, 251, "Actor"], [285, 305, "Actor"], [369, 389, "Actor"], [328, 339, "Actor"]]]]